OwnerViewId Property
 The id of the view that owns the element.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public ElementId OwnerViewId { get; }
  Visual Basic
Public ReadOnly Property OwnerViewId As ElementId
	Get
  Visual C++
public:
property ElementId^ OwnerViewId {
	ElementId^ get ();
}
 See Also
  Element Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →